app/controllers/stories_controller.rb

        to = Date.current.end_of_month.to_datetime
      end

      options[:conditions] = ["blips_count >= ? AND (stories.created_at >= ? AND stories.created_at <= ?)", min_blips, from, to]
---
INSERT INTO "blips" ("avatar_path", "status_type", "updated_at", "body", "blip_id", "asset_path", "author", "story_id", "created_at") VALUES(E'/user_generated/avatars/482908_pico.jpg', E'Status', '2009-11-14 19:58:15.027185', E'http://blip.pl/s/20554253 właściwy tytuł dzieła: tester kontrastu monitorów LCD ;-)', 20575733, NULL, E'djcmedia', NULL, '2009-11-14 19:58:15.027185') RETURNING "id"
INSERT INTO "stories" ("avatar_path", "status_type", "updated_at", "body", "blip_id", "asset_path", "author", "blips_count", "created_at") VALUES(E'/user_generated/avatars/617677_pico.jpg', E'Status', '2009-11-15 13:04:53.010027', E'Off, trzeba zarobić ciasto na pizzę i pomóc mu urosnąć. Uwielbiam zapach pizzy w domu...', 20653781, NULL, E'lenka2000', NULL, '2009-11-15 14:02:28.000000') RETURNING "id"