app/controllers/stories_controller.rb

SELECT * FROM "stories" WHERE ("stories"."blips_count" >= 2) ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "stories" WHERE ("stories"."blips_count" >= 2)
---
  def index
    @stories = Story.paginate :conditions => { :blips_count.gte => 2 }, :order => 'created_at ASC', :per_page => 10, :page => params[:page]

SELECT * FROM "blips" WHERE ("blips"."blip_id" = 20583227) AND ("blips".story_id = 92) LIMIT 1
SELECT * FROM "stories" WHERE ("stories"."blip_id" = 20520382) LIMIT 1
---
  def show
    @story = Story.find_by_blip_id(params[:id])